export const questions = {
  variant1: [
    {
      id: 1,
      question:
        "Главная задача капитана и экипажа судна в аварийных ситуациях:",
      options: [
        "сохранение груза",
        "сохранение человеческой жизни",
        "сохранение судна",
        "сохранение судна и груза",
      ],
      answerIndex: 1,
    },
    {
      id: 2,
      question: "Длина пожарных рукавов на открытой палубе:",
      options: ["25–30 м", "25 м", "20–25 м", "15–20 м"],
      answerIndex: 3,
    },
    {
      id: 3,
      question: "Длина пожарных рукавов во внутренних помещениях:",
      options: ["15 м", "15–20 м", "20 м", "10–15 м"],
      answerIndex: 3,
    },
    {
      id: 4,
      question: "Материалы, относящиеся к классу пожара – А:",
      options: [
        "горючие жидкости",
        "горючие газы",
        "твердые горючие материалы",
        "металлы",
      ],
      answerIndex: 2,
    },
    {
      id: 5,
      question: "Материалы, относящиеся к классу пожара – В:",
      options: [
        "горючие жидкости",
        "горючие газы",
        "твердые горючие материалы",
        "электроустановки под напряжением",
      ],
      answerIndex: 0,
    },
    {
      id: 6,
      question: "Материалы, относящиеся к классу пожара – С:",
      options: [
        "горючие жидкости",
        "горючие газы",
        "твердые горючие материалы",
        "металлы",
      ],
      answerIndex: 1,
    },
    {
      id: 7,
      question: "Материалы, относящиеся к классу пожара – D:",
      options: [
        "металлы",
        "горючие жидкости",
        "горючие газы",
        "твердые горючие материалы",
      ],
      answerIndex: 0,
    },
    {
      id: 8,
      question: "Материалы, относящиеся к классу пожара – E:",
      options: [
        "горючие жидкости",
        "горючие газы",
        "твердые горючие материалы",
        "электроустановки под напряжением",
      ],
      answerIndex: 3,
    },
    {
      id: 9,
      question: "Горение — это:",
      options: [
        "процесс без выделения тепла",
        "процесс, сопровождаемый выделением света",
        "процесс, сопровождаемый выделением дыма",
        "процесс, сопровождаемый выделением тепла, света и дыма",
      ],
      answerIndex: 3,
    },
    {
      id: 10,
      question: "Треугольник пожара-это:",
      options: [
        "горючее вещество, горючая жидкость,источник тепла",
        "горючее вещество, окислитель, источник тепла ",
        "горючее вещ-во, окислитель, источник света",
        "горючее вещество, источник света, источник тепла",
      ],
      answerIndex: 1,
    },
    {
      id: 11,
      question: "Состав звена разведки аварийной партии: ",
      options: ["2 человека", "3 человека", "4 человека", "5 человек"],
      answerIndex: 1,
    },
    {
      id: 12,
      question: "Легковоспламеняющиеся жидкости-это:",
      options: [
        "наличие на борту нефтепродуктов",
        "наличие на борту токсичных веществ",
        "наличие на борту опасных веществ",
        "при всех перечисленных",
      ],
      answerIndex: 3,
    },
    {
      id: 13,
      question:
        "Что из перечисленного относится к опасным веществам класса 4.1:",
      options: [
        "легковоспламеняющиеся твердые вещества",
        "легковоспламеняющиеся жидкости",
        "галогенированные углеводороды",
        "негорючие газы",
      ],
      answerIndex: 0,
    },
    {
      id: 14,
      question:
        "Что из перечисленного относится к опасным веществам класса 5.2:",
      options: [
        "органические пероксиды",
        "нейтральные газы",
        "токсичные вещества",
        "едкие растворы",
      ],
      answerIndex: 0,
    },
    {
      id: 15,
      question: "Чему равна кратность «высокократной» пены?",
      options: ["1:100", "1:500", "1:1000", "1:5000"],
      answerIndex: 2,
    },
    {
      id: 16,
      question: "Кратность «низкократной» пены равна:",
      options: ["1:5", "1:10", "1:15", "1:50"],
      answerIndex: 2,
    },
    {
      id: 17,
      question: "Площадь противопожарной зоны равна:",
      options: ["100–120 м²", "120–150 м²", "150–170 м²", "170–200 м²"],
      answerIndex: 2,
    },
    {
      id: 18,
      question: "Продолжительность противопожарной зоны равна:",
      options: ["25 м", "30 м", "35 м", "40 м"],
      answerIndex: 1,
    },
    {
      id: 19,
      question: "Виды конструктивной противопожарной защиты:",
      options: [
        "пассивную и объемную",
        "активную и объемную",
        "активную и пассивную",
        "межпалубную и активную",
      ],
      answerIndex: 2,
    },
    {
      id: 20,
      question: "Классы огнезадерживающих конструкций:",
      options: ["A, Б, В", "15, 30, 60", "1, 2, 3", "A, В, С"],
      answerIndex: 3,
    },
    {
      id: 21,
      question: "Конструкция типа A-60 представляет:",
      options: [
        "T=60 мин, t=725 °C, с другой стороны 150 °C",
        "T=60 сек, t=835 °C, с другой стороны 145 °C",
        "T=60 мин, t=925 °C, с другой стороны 140 °C",
        "T=60 мин, t=935 °C, с другой стороны 150 °C",
      ],
      answerIndex: 2,
    },
    {
      id: 22,
      question: "Конструкция типа A-30 представляет:",
      options: [
        "T=30 час, t=725 °C, с другой стороны 135 °C",
        "T=30 мин, t=821 °C, с другой стороны 140 °C",
        "T=30 сек, t=925 °C, с другой стороны 145 °C",
        "T=30 мин, t=750 °C, с другой стороны 150 °C",
      ],
      answerIndex: 1,
    },
    {
      id: 23,
      question: "Конструкция типа A-15 представляет:",
      options: [
        "T=15 мин, t=825 °C, с другой стороны 130 °C",
        "T=60 мин, t=725 °C, с другой стороны 120 °C",
        "T=15 мин, t=718 °C, с другой стороны 140 °C",
        "T=60 сек, t=915 °C, с другой стороны 150 °C",
      ],
      answerIndex: 2,
    },
    {
      id: 24,
      question: "Конструкция типа B-30 представляет:",
      options: [
        "T=30 мин, t=821 °C, с другой стороны 140 °C",
        "T=30 час, t=718 °C, с другой стороны 135 °C",
        "T=30 мин, t=925 °C, с другой стороны 140 °C",
        "T=30 сек, t=950 °C, с другой стороны 145 °C",
      ],
      answerIndex: 0,
    },
    {
      id: 25,
      question: "Конструкция типа B-15 представляет:",
      options: [
        "T=15 мин, t=625 °C, с другой стороны 140 °C",
        "T=15 мин, t=718 °C, с другой стороны 140 °C",
        "T=15 мин, t=759 °C, с другой стороны 145 °C",
        "T=15 мин, t=825 °C, с другой стороны 150 °C",
      ],
      answerIndex: 1,
    },
    {
      id: 26,
      question: "Конструкция типа B-0 представляет:",
      options: [
        "T=0 мин, t=556 °C, с другой стороны 0 °C",
        "T=0 мин, t=625 °C, с другой стороны 145 °C",
        "T=0 мин, t=773 °C, с другой стороны 150 °C",
        "T=0 мин, t=827 °C, с другой стороны 160 °C",
      ],
      answerIndex: 1,
    },
    {
      id: 27,
      question:
        "Устройство закрытия дверей автоматически срабатывает при повышении температуры до:",
      options: ["50–60 °C", "60–70 °C", "70–80 °C", "80–90 °C"],
      answerIndex: 2,
    },
    {
      id: 28,
      question:
        "Механизм самозакрывания надежно работает при крене и дифференте:",
      options: ["2,5°", "3,5°", "4,5°", "5,0°"],
      answerIndex: 1,
    },
    {
      id: 29,
      question: "Значение закрытия с маркировкой “Б” в синем круге:",
      options: [
        "постоянно открыты",
        "постоянно закрыты",
        "закрываются по общесудовой тревоге",
        "открываются по общесудовой тревоге",
      ],
      answerIndex: 1,
    },
    {
      id: 30,
      question: "Значение закрытия с маркировкой “З” в синем круге:",
      options: [
        "постоянно открыты",
        "постоянно закрыты",
        "закрываются по общесудовой тревоге",
        "открываются по общесудовой тревоге",
      ],
      answerIndex: 1,
    },
  ],

  ///////////////////////////////////////////////////////////////////
  variant2: [
    {
      id: 1,
      question: "Температура срабатывания спринклерной системы:",
      options: ["65 -75С", "68 -79С", "71 -84С", "82 -89С"],
      answerIndex: 1,
    },
    {
      id: 2,
      question: "Производительность насоса системы водяных завес составляет:",
      options: ["70 л/мин", "80 л/мин", "90 л/мин", "100 л/мин"],
      answerIndex: 0,
    },
    {
      id: 3,
      question:
        "Тушение углекислотной системой производится в следующих помещениях:",
      options: [
        "машинное отделение и трюма",
        "внутренние жилые и вспомогательные",
        "наружные и внутренние",
        "рыбцех и мучной трюм",
      ],
      answerIndex: 0,
    },
    {
      id: 4,
      question:
        "Расход порошка системы порошкового тушения на ручной ствол должен быть не менее:",
      options: ["2,5 кг/с", "3,0 кг/с", "3,5 кг/с", "4,0 кг/с"],
      answerIndex: 2,
    },
    {
      id: 5,
      question: "Длина струи порошка должна быть не менее:",
      options: ["5 м", "7 м", "8 м", "10м"],
      answerIndex: 2,
    },
    {
      id: 6,
      question: "Пожарный план-это:",
      options: [
        "план борьбы с пожаром",
        "план размещения оборудования и путей эвакуации",
        "план размещения документации",
        "план систем пожаротушения",
      ],
      answerIndex: 1,
    },
    {
      id: 7,
      question:
        "Вахтенным помощником капитана по общесудовой тревоге является:",
      options: [
        "второй помощник капитана",
        "третий помощник капитан",
        "старший помощник капитана",
        "капитан",
      ],
      answerIndex: 2,
    },
    {
      id: 8,
      question:
        "Руководит аварийной партией на палубе на судах с экипажем до 50 чел:",
      options: [
        "старший помощник капитана",
        "второй помощник капитана",
        "третий помощник капитана",
        "четвертый помощник капитана",
      ],
      answerIndex: 1,
    },
    {
      id: 9,
      question: "Руководит аварийной группой в МКО:",
      options: [
        "старший механик",
        "второй механик",
        "третий механик",
        "четвертый механик",
      ],
      answerIndex: 1,
    },
    {
      id: 10,
      question: "Место размещения противопожарного снабжения:",
      options: [
        "в шкиперской",
        "в форпике",
        "палубный и машинный пожарный пост",
        "верхний мостик",
      ],
      answerIndex: 2,
    },
    {
      id: 11,
      question:
        "Ответственный за укомплектованность противопожарным снабжением-это:",
      options: [
        "боцман",
        "ст. пом. капитана",
        "капитан",
        "главный (старший)механик",
      ],
      answerIndex: 2,
    },
    {
      id: 12,
      question: "Диаметр пожарных шлангов:",
      options: [
        "50, 65, 75 мм",
        "51, 66, 77 мм",
        "52, 67, 78 мм",
        "53, 68, 79 мм",
      ],
      answerIndex: 1,
    },
    {
      id: 13,
      question: "Диаметр насадки пожарного ствола:",
      options: [
        "12, 16, 19 мм",
        "14, 16, 18 мм",
        "16, 17, 20 мм",
        "12, 15, 18 мм",
      ],
      answerIndex: 0,
    },
    {
      id: 14,
      question: "Негорючие материалы-это:",
      options: [
        "при нагревании до 75С не горят, но выделяют горючие газы",
        "при нагревании до 75С не горят и не выделяют горючие газы",
        "при нагревании до 75С горят и выделяют горючие газы",
        "при нагревании до 75С горят и не выделяют горючие газы",
      ],
      answerIndex: 1,
    },
    {
      id: 15,
      question: "Горючие материалы-это:",
      options: [
        "воспламеняются при температуре ниже 750С от источника горения, но не горят после его удаления",
        "воспламеняются при температуре выше 750С от источника горения, продолжают гореть после его удаления",
        "воспламеняются при температуре ниже 750С от источника горения, продолжают гореть после его удаления",
        "не воспламеняются при температуре ниже 750С от источника горения, только тлеют после его удаления",
      ],
      answerIndex: 2,
    },
    {
      id: 16,
      question: "Трудно горючие материалы-это:",
      options: [
        "воспламеняются при температуре ниже 750С, только горят и тлеют от источника зажигания и перестают гореть и тлеть после его удаления",
        "воспламеняются при температуре выше 750С, горят и тлеют при зажигании и продолжают гореть и тлеть после его удаления",
        "воспламеняются при температуре ниже 750С, только горят и тлеют от источника зажигания и продолжают гореть и тлеть после его удаления",
        "воспламеняются при температуре выше 750С, только горят и тлеют от источника зажигания и перестают гореть и тлеть после его удаления",
      ],
      answerIndex: 0,
    },
    {
      id: 17,
      question: "Трудно воспламеняющиеся материалы-это:",
      options: [
        "воспламеняются при температуре выше 750С, горят и тлеют под действием источника зажигания, горят и тлеют после его удаления затухающим пламенем",
        "воспламеняются при температуре ниже 750С, горят и тлеют под действием источника зажигания, горят и тлеют после его удаления затухающим пламенем",
        "воспламеняются при температуре ниже 750С, горят и тлеют под действием источника зажигания, продолжают гореть и тлеть после его удаления",
        "воспламеняются при температуре выше 750С, горят и тлеют при  зажигании, не горят и тлеть после его удаления",
      ],
      answerIndex: 1,
    },
    {
      id: 18,
      question: "Температура пламени твердых материалов равна:",
      options: ["900С", "1000С", "1100С", "1200С"],
      answerIndex: 1,
    },
    {
      id: 19,
      question: "Температура пламени жидких материалов равна:",
      options: ["900-1000С", "1000-1100С", "1100-1200С", "1200-1300С"],
      answerIndex: 2,
    },
    {
      id: 20,
      question: "Температура пламени газообразных материалов равна:",
      options: ["1300С", "1400С", "1500С", "1600С"],
      answerIndex: 2,
    },
    {
      id: 21,
      question: "Проверка противопожарных дверей проводится не реже:",
      options: [
        "1 раза в неделю",
        "1 раза в месяц",
        "1 раза в квартал",
        "1 раза в год",
      ],
      answerIndex: 1,
    },
    {
      id: 22,
      question:
        "Какое минимальное количество пожарных насосов должно быть на судах:",
      options: ["3", "2", "1", "0"],
      answerIndex: 1,
    },
    {
      id: 23,
      question:
        "Минимальная производительность пожарных насосов должна быть на судах:",
      options: ["15 м3/с", "20 м3/с", "25 м3/с", "30 м3/с"],
      answerIndex: 2,
    },
    {
      id: 24,
      question:
        "Воздушно-пенный ствол в судовых помещениях должен подавать количество пены низкой кратности:",
      options: ["≥1,5 м3/мин", "≥2 м3/мин", "≥2,5 м3/мин", "≥3 м3/мин"],
      answerIndex: 1,
    },
    {
      id: 25,
      question:
        "Лицо дающее разрешение на проведение огневых работ силами экипажа на судне, стоящем в порту:",
      options: [
        "капитан судна",
        "капитан порта",
        "инспектор пожарной охраны",
        "инспектор портового контроля",
      ],
      answerIndex: 1,
    },
    {
      id: 26,
      question:
        "Лицо дающее разрешение на проведение огневых работ при стоянке судна на СРЗ в зоне ответственности капитана порта:",
      options: [
        "директор СРЗ",
        "капитан судна",
        "инспектор пожарной охраны",
        "капитан порта",
      ],
      answerIndex: 3,
    },
    {
      id: 27,
      question:
        "Дни на которые может быть продлен заказ-наряд на проведение огневых работ на одном и том же месте:",
      options: ["3 дня", "5 дней", "2 дня", "не продлевается"],
      answerIndex: 1,
    },
    {
      id: 28,
      question:
        "Документ издаваемый капитаном судна для обеспечения безопасности при подготовке  к проведению огневых работ:",
      options: ["распоряжение", "приказ", "информация", "бюллетень"],
      answerIndex: 1,
    },
    {
      id: 29,
      question:
        "Расстояние установки пожарных кранов во внутренних помещениях:",
      options: ["≤10 м", "≤15 м", "≤20 м", "≤25 м"],
      answerIndex: 2,
    },
    {
      id: 30,
      question: "Расстоянии установки пожарных кранов на открытых палубах?",
      options: ["≤35 м", "≤40 м", "≤45 м", "≤50 м"],
      answerIndex: 1,
    },
  ],
  // ... agrega las restantes preguntas de la variante 2
  /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  variant3: [
    {
      id: 1,
      question: "Место ст.пом.капитана по общесудовой тревоге:",
      options: [
        "на мостике",
        "в штурманской рубке",
        "на ГКП",
        "на месте аварии",
      ],
      answerIndex: 2,
    },
    {
      id: 2,
      question:
        "Время производства дозора помещений на случай пожаробезопасности:",
      options: [
        "23.00 - 06.00 каждый ч, днем каждые 2ч.",
        "20.00 – 08.00 каждый ч., днем каждый ч.",
        "днем и ночью через 2 часа",
        "22.00 – 06.00 каждые 2 часа, днем через 4 часа",
      ],
      answerIndex: 0,
    },
    {
      id: 3,
      question: "Количество разделов оперативного плана:",
      options: ["3", "4", "5", "6"],
      answerIndex: 2,
    },
    {
      id: 4,
      question: "По окончании огневых работ вахта снимается через:",
      options: [
        "3 часа",
        "2 часа",
        "1 час",
        "сразу снимается и помещение передается ответственному за него",
      ],
      answerIndex: 2,
    },
    {
      id: 5,
      question:
        "По окончании огневых работ наблюдение за местом  производится в течении:",
      options: ["6 часов", "12 часов", "24 часов", "4 часов"],
      answerIndex: 1,
    },
    {
      id: 6,
      question:
        "Время в которое можно вентилировать помещение после тушения пожара:",
      options: ["сразу", "через 1 час", "через 2 часа", "через 4 часа"],
      answerIndex: 2,
    },
    {
      id: 7,
      question:
        "Количество дежурных шлюпок которое должно иметь рыболовное судно длиной более 45 м:",
      options: ["ни одной", "1", "2", "дополнительно спасательный плот"],
      answerIndex: 1,
    },
    {
      id: 8,
      question:
        "Время за которое должна быть подготовлена к спуску спасательная шлюпка:",
      options: ["3 мин", "5 мин", "7 мин", "10 мин"],
      answerIndex: 1,
    },
    {
      id: 9,
      question:
        "Время за которое должны быть спущены на воду спасательные шлюпки и плоты с полным комплектом людей и снабжения:",
      options: ["5 мин", "7 мин", "10 мин", "15 мин"],
      answerIndex: 2,
    },
    {
      id: 10,
      question:
        "Время за которое должен выдержать влияние окружающей среды спасательный плот при любых условиях плавания:",
      options: ["15 сут.", "20 сут.", "25 сут.", "30 сут."],
      answerIndex: 3,
    },
    {
      id: 11,
      question: "Конструкция плота должна выдержать сброс в воду с высоты:",
      options: ["15 м", "18 м", "20 м", "25 м"],
      answerIndex: 1,
    },
    {
      id: 12,
      question:
        "Скорость которую должен выдерживать буксируемый спасательный плот:",
      options: ["2,5 уз", "3,0 уз", "3,5 уз", "4,0 уз"],
      answerIndex: 1,
    },
    {
      id: 13,
      question: "Высота позволяющая прыгать на плот без его повреждений:",
      options: ["3,0 м", "3,5 м", "4,0 м", "4,5 м"],
      answerIndex: 3,
    },
    {
      id: 14,
      question: "Нижняя балясина должна быть ниже ватерлинии плота:",
      options: ["0,3 м", "0,4 м", "0,5 м", "0,6 м"],
      answerIndex: 1,
    },
    {
      id: 15,
      question: "Время надувания плота при температуре от 18С до 20 С:",
      options: ["1 мин", "2 мин", "3 мин", "5 мин"],
      answerIndex: 0,
    },
    {
      id: 16,
      question: "Время надувания плота при температуре  - 30С:",
      options: ["2 мин", "3 мин", "4 мин", "5 мин"],
      answerIndex: 1,
    },
    {
      id: 17,
      question:
        "Расстояние от места огневых работ допускающее проводить окрасочные работы:",
      options: ["10 м", "15 м", "20 м", "25 м"],
      answerIndex: 2,
    },
    {
      id: 18,
      question:
        "Рукава для  кислорода должны быть удалены от электрических кабелей на расстояние:",
      options: ["≥0,5м", "≥1,0м", "≥1,5м", "≥2,0м"],
      answerIndex: 0,
    },
    {
      id: 19,
      question:
        "Рукава для горючих газов и керосина должны быть удалены от электрических кабелей на расстояние:",
      options: ["≥0,5м", "≥1,0м", "≥1,5м", "≥2,0м"],
      answerIndex: 1,
    },
    {
      id: 20,
      question:
        "Длина рыболовного судна допускающая  иметь дежурную шлюпку длиной менее 3.8 м, но не менее 3.3 м:",
      options: ["более36 м", "менее 45 м", "более 50 м", "менее 100 м"],
      answerIndex: 1,
    },
    {
      id: 21,
      question:
        "Время и количество человек способных спустить на воду спасательную шлюпку:",
      options: [
        "4 человека за 5 мин",
        "3 человека за 8 мин",
        "2 человека за 5  мин",
        "2 человека за 10 мин",
      ],
      answerIndex: 2,
    },
    {
      id: 22,
      question:
        "Покрывало для тушения пламени по требованиям противопожарной защиты имеет размеры:",
      options: ["2 х 2 м", "1,5 х 1,5 м", "1,5 х 2 м", "2,5 х 2 м"],
      answerIndex: 2,
    },
    {
      id: 23,
      question: "Длина штормтрапа для пересадки людей составляет:",
      options: [
        "от 1,5 м до 9 м",
        "от 2,0 м до 10 м",
        "от 1,0 м до 9 м",
        "от 0,5 м до 10 м",
      ],
      answerIndex: 0,
    },
    {
      id: 24,
      question: "Длина балясины штормтрапа равна:",
      options: ["450 мм", "500 мм", "485 мм", "525 мм"],
      answerIndex: 2,
    },
    {
      id: 25,
      question: "Ширина балясины равна:",
      options: ["105 мм", "115 мм", "125 мм", "130 мм"],
      answerIndex: 1,
    },
    {
      id: 26,
      question:
        "Расстояние между балясинами штормтрапа максимально составляет:",
      options: ["400 мм", "350 мм", "380 мм", "375 мм"],
      answerIndex: 2,
    },
    {
      id: 27,
      question:
        "Давление в пожарных кранах для рыболовных судов длиной более 45 м при работе всех пожарных насосов:",
      options: ["0,15 н/мм2", "0,20 н/мм2", "0,25 н/мм2", "0,30 н/мм2"],
      answerIndex: 2,
    },
    {
      id: 28,
      question:
        "Петли дверей типа А и детали задраек и замков должны быть изготовлены из материалов с температурой плавления:",
      options: ["≥900С", "≥925С", "≥950С", "≥975С"],
      answerIndex: 2,
    },
    {
      id: 29,
      question:
        "Петли дверей типа В и детали задраек и замков должны быть изготовлены из материалов с температурой плавления:",
      options: ["≥815С", "≥825С", "≥835С", "≥845С"],
      answerIndex: 3,
    },
    {
      id: 30,
      question:
        "Воздушно-пенный ствол низкой кратности должен обеспечивать подачу пены на расстояние более 15 м более:",
      options: ["3,5 м3/мин", "4,0 м3/мин", "4,5 м3/мин", "5,0 м3/мин"],
      answerIndex: 1,
    },
  ],
};
